# Copyright (C) 2024 Intel Corporation
# SPDX-License-Identifier: Apache-2.0

name: "stability"
backend: "python"

input [
  {
    name: "INPUT0"
    data_type: TYPE_UINT8
    dims: [ -1, -1 ]
  }
]
output [
  {
    name: "OUTPUT0"
    data_type: TYPE_UINT8
    dims: [ -1, -1, -1, 3 ]
  }
]

instance_group [{ kind: KIND_CPU }]
